<?php
  $students[class1] = [
    "はるき" => [
        "数学" => 90,
        "英語" => 80,
        "日本語" => 75,
    ],
    "かおる" => [
        "数学" => 95,
        "英語" => 85,
        "日本語" => 100,
    ],
    "はじめ" => [
        "数学" => 60,
        "英語" => 90,
        "日本語" => 80,
    ]
    ];
    
  $students[class2] = [
    "やすあき" => [
        "数学" => 100,
        "英語" => 100,
        "日本語" => 100,
    ],
    "ひかる" => [
        "数学" => 90,
        "英語" => 50,
        "日本語" => 100
    ]
    ];
    print("<pre>");
    var_dump($students);
    print("</pre>");